# Assessing Users Data in Python

In [436]:
# import packages
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
import seaborn as sns

In [437]:
# read the ecommerce file into a dataframe with only the file name if it is in the same folder as the notebook
df_users = pd.read_csv('ecommerce_users.csv')

# read the file with the full file path
df_users = pd.read_csv(r'C:\Users\iolowoye\Documents\Uranus Academy\ecommerce_users.csv')

## Functions to assess dataframes(tables) in pandas
### Looking at what the dataframe contains
1. head function
2. tail function
3. sample function

In [438]:
# the head function
df_users.head() # by default, it shows the first five rows

,id,first_name,last_name,phone_number,email,age,gender,state,street_address,postal_code,city,country,latitude,longitude,traffic_source,created_at
0,21304,Heidi,Hall,NaN,heidihall@example.net,70.0,F,Gyeonggi-do,9401 Howard Road Apt. 695,415-850,Gimpo City,South Korea,37.640589,126.566183,Search,2019-01-02 00:19:00 UTC
1,5012,Billy,Guerrero,1.800341e+09,billyguerrero@example.net,33.0,M,Texas,533 Patricia Roads Apt. 472,79928,Horizon City,United States,31.642378,-106.141715,Search,2019-01-02 00:29:00 UTC
2,27817,Antonio,Williams,NaN,antoniowilliams@example.net,20.0,M,Zhejiang,0381 Baker Stream Apt. 075,312599,Wuhan,China,29.504850,120.901029,Search,2019-01-02 00:35:00 UTC
3,14079,Ryan,Brown,NaN,ryanbrown@example.com,68.0,M,Bahia,277 Walker Mountains,45920-000,Nova Viçosa,Brasil,-17.900464,-39.716076,Search,2019-01-02 00:43:00 UTC
4,93946,Sabrina,Rodriguez,1.800594e+09,sabrinarodriguez@example.net,39.0,F,Florida,06720 Smith Summit Suite 860,34711,Clermont,United States,28.525665,-81.756419,Search,2019-01-02 01:14:00 UTC

In [439]:
# to see other than five rows, you put the number in the bracket
df_users.head(3)

,id,first_name,last_name,phone_number,email,age,gender,state,street_address,postal_code,city,country,latitude,longitude,traffic_source,created_at
0,21304,Heidi,Hall,NaN,heidihall@example.net,70.0,F,Gyeonggi-do,9401 Howard Road Apt. 695,415-850,Gimpo City,South Korea,37.640589,126.566183,Search,2019-01-02 00:19:00 UTC
1,5012,Billy,Guerrero,1.800341e+09,billyguerrero@example.net,33.0,M,Texas,533 Patricia Roads Apt. 472,79928,Horizon City,United States,31.642378,-106.141715,Search,2019-01-02 00:29:00 UTC
2,27817,Antonio,Williams,NaN,antoniowilliams@example.net,20.0,M,Zhejiang,0381 Baker Stream Apt. 075,312599,Wuhan,China,29.504850,120.901029,Search,2019-01-02 00:35:00 UTC

In [440]:
# the tail function
df_users.tail(6)

,id,first_name,last_name,phone_number,email,age,gender,state,street_address,postal_code,city,country,latitude,longitude,traffic_source,created_at
99994,79066,Travis,Allen,1.800556e+09,travisallen@example.org,17.0,M,California,665 Richard Inlet,91767,Pomona,United States,34.081517,-117.738461,Search,2023-04-26 19:23:03.636324 UTC
99995,98969,Linda,Mcgrath,1.800139e+09,lindamcgrath@example.org,54.0,F,Florida,2787 Barrett Valleys Apt. 986,33312,Fort Lauderdale,United States,26.088242,-80.181492,Display,2023-04-26 19:25:09.399335 UTC
99996,56920,Jasmine,Valdez,NaN,jasminevaldez@example.net,68.0,F,Île-de-France,4700 Mccann Green,75016,Paris,France,48.857391,2.256367,Search,2023-04-26 19:29:08.280281 UTC
99997,77719,Haley,Campbell,NaN,haleycampbell@example.com,50.0,F,Bourgogne-Franche-Comté,855 Suarez Walks,21000,Dijon,France,47.322872,5.037560,Search,2023-04-26 19:29:23.730034 UTC
99998,70163,Brianna,Dalton,1.800954e+09,briannadalton@example.com,28.0,F,Texas,015 Mcgee Fords Apt. 880,78589,San Juan,United States,26.186049,-98.151782,Search,2023-04-26 19:33:36.935949 UTC
99999,95519,Darin,Ortiz,NaN,darinortiz@example.com,66.0,M,Rio de Janeiro,430 Megan Mission,22750-008,Rio de Janeiro,Brasil,-22.937678,-43.336215,Search,2023-04-26 19:35:28.485865 UTC

In [441]:
# sample function
df_users.sample(5)

,id,first_name,last_name,phone_number,email,age,gender,state,street_address,postal_code,city,country,latitude,longitude,traffic_source,created_at
99752,89951,Michael,Scott,NaN,michaelscott@example.com,33.0,M,Gyeonggi-do,62022 Harmon Turnpike Apt. 635,472-870,Namyangju City,South Korea,37.568138,127.299258,Search,2023-04-26 10:29:00 UTC
27995,39530,Sydney,Bates,NaN,sydneybates@example.org,64.0,F,Shanghai,8551 Lopez Terrace Apt. 336,200011,Yangquan,China,31.194115,121.502122,Search,2020-03-27 15:23:00 UTC
73503,97547,Kimberly,Davis,NaN,kimberlydavis@example.com,15.0,F,Bahia,283 Harvey Squares Apt. 461,48500-000,Euclides da Cunha,Brasil,-10.464100,-38.876627,Search,2022-04-06 08:49:00 UTC
52453,71601,Mike,Garrett,1.800125e+09,mikegarrett@example.org,49.0,M,Illinois,6067 Brown Cove,60411,Chicago Heights,United States,41.507851,-87.591454,Search,2021-04-28 01:43:00 UTC
17300,9806,Pamela,Hawkins,NaN,pamelahawkins@example.org,69.0,F,Shandong,5667 Robert Ridge,250061,Chengdu,China,36.630545,117.049800,Search,2019-10-08 05:11:00 UTC

### Describing the data
1. info
2. describe

`dataframe.info()` summarizes:
* The number of rows and columns present
* It counts not null values present
* Datatypes that are present

In [442]:
df_users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 16 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   id              100000 non-null  int64
 1   first_name      100000 non-null  object
 2   last_name       100000 non-null  object
 3   phone_number    22669 non-null   float64
 4   email           99999 non-null   object
 5   age             99998 non-null   float64
 6   gender          100000 non-null  object
 7   state           100000 non-null  object
 8   street_address  100000 non-null  object
 9   postal_code     100000 non-null  object
 10  city            99007 non-null   object
 11  country         100000 non-null  object
 12  latitude        99998 non-null   float64
 13  longitude       99998 non-null   float64
 14  traffic_source  100000 non-null  object
 15  created_at      100000 non-null  object
dtypes: float64(4), int64(1), object(11)
memory usage: 12.2+ MB

#### Issue log
1. Null values in phone number, email, age, city, longitude and latitude fields
2. Id, phone number, age, latitude and longitude have inaccurate data types

In [443]:
df_users.describe()

                  id  phone_number           age      latitude     longitude
count  100000.000000  2.266900e+04  99998.000000  99998.000000  99998.000000
mean    50000.500000  1.800250e+09     41.006170     28.305884     24.344178
std     28867.657797  2.262793e+07     17.033479     22.052213     89.964565
min         1.000000  1.800387e+07     12.000000    -43.160756   -158.164931
25%     25000.750000  1.800324e+09     26.000000     26.110473    -51.049500
50%     50000.500000  1.800550e+09     41.000000     35.247482      4.411841
75%     75000.250000  1.800773e+09     56.000000     40.725404    116.345098
max    100000.000000  1.801000e+09     70.000000     64.865194    153.560238

#### Number of rows and columns present: df.shape

In [444]:
df_users.shape

(100000, 16)

In [445]:
# separate rows
df_users.shape[0]

100000

In [446]:
len(df_users)

100000

In [447]:
# separate columns
df_users.shape[1]

16

#### Count not null values: df.notna().sum()

In [448]:
# count not null values
df_users.notnull().sum()

id                100000
first_name        100000
last_name         100000
phone_number       22669
email              99999
age                99998
gender            100000
state             100000
street_address    100000
postal_code       100000
city               99007
country           100000
latitude           99998
longitude          99998
traffic_source    100000
created_at        100000
dtype: int64

In [449]:
# count null values
df_users.isnull().sum()

id                    0
first_name            0
last_name             0
phone_number      77331
email                 1
age                   2
gender                0
state                 0
street_address        0
postal_code           0
city                993
country               0
latitude              2
longitude             2
traffic_source        0
created_at            0
dtype: int64

In [450]:
# not null for the city column
df_users['city'].notnull().sum()

99007

In [451]:
# not null for the city column
df_users.city.notnull().sum()

99007

#### Know datatypes: df.dtypes

In [452]:
df_users.dtypes

id                  int64
first_name         object
last_name          object
phone_number      float64
email              object
age               float64
gender             object
state              object
street_address     object
postal_code        object
city               object
country            object
latitude          float64
longitude         float64
traffic_source     object
created_at         object
dtype: object

In [453]:
df_users.city.dtypes

dtype('O')

In [454]:
df_users['city'].dtypes

dtype('O')

In [455]:
df_users.age.dtypes

dtype('float64')

In [456]:
df_users.id.dtypes

dtype('int64')

#### Check for duplicates

In [457]:
df_users.duplicated().sum()

0

In [458]:
df_users['email'].duplicated().sum()

16170

In [459]:
df_users.duplicated(['email','id']).sum()

0

## Data Cleaning

1. Trim whitespace
2. Join first and last name together in one column in proper case
3. Remove phone numbers with incorrect length if any
4. Id and phone number columns should be strings not numbers
5. Clean email domain names and write all emails in lower case
6. Check for duplicate email addresses as this can point to same user
7. Fill up blank ages with the mean ages
8. Join latitude and longitude together
9. Remove UTC from created at column
10. Clean out the country column: Brazil and Brasil; Espana and Spain; Deutschland and Germany
11. Change Los Angeles state to California state

**Make a copy of the dataframe and perform our cleaning on the copy**

In [460]:
df_users_clean = df_users.copy()

1. Trim whitespace
Function to use is the `.str.strip()`. The alternatives are `.str.lstrip()` and `.str.rstrip()`.

To trim whitespace in the id column, we need to convert this column to a string first. The function we use to convert datatypes is .astype(). Inside the bracket, you write the new datatype that you want. Common ways to write the new datatype are str for string, int for integer, float for numbers with decimals.

In [461]:
df_users_clean.dtypes

id                  int64
first_name         object
last_name          object
phone_number      float64
email              object
age               float64
gender             object
state              object
street_address     object
postal_code        object
city               object
country            object
latitude          float64
longitude         float64
traffic_source     object
created_at         object
dtype: object

In [462]:
df_users_clean['id'] = df_users_clean['id'].astype(str)

Test

In [463]:
df_users_clean['id'].dtypes

dtype('O')

In [464]:
df_users_clean.dtypes

id                 object
first_name         object
last_name          object
phone_number      float64
email              object
age               float64
gender             object
state              object
street_address     object
postal_code        object
city               object
country            object
latitude          float64
longitude         float64
traffic_source     object
created_at         object
dtype: object

To trim whitespace in the id column:

In [465]:
df_users_clean['id'] = df_users_clean['id'].str.strip()

To trim whitespace in all string columns
1. Identify the columns that are strings with an if condition
2. Group them all together
3. Run a for loop to strip all the identified columns

List out all the columns

In [466]:
df_users_clean.columns

Index(['id', 'first_name', 'last_name', 'phone_number', 'email', 'age',
       'gender', 'state', 'street_address', 'postal_code', 'city', 'country',
       'latitude', 'longitude', 'traffic_source', 'created_at'],
      dtype='object')

In [467]:
for column in df_users_clean.columns:
    if df_users_clean[column].dtypes == 'object':
        df_users_clean[column] = df_users_clean[column].str.strip()

2. Join first name and last name columns together
Function to use is the + sign

In [468]:
df_users_clean.head()

,id,first_name,last_name,phone_number,email,age,gender,state,street_address,postal_code,city,country,latitude,longitude,traffic_source,created_at
0,21304,Heidi,Hall,NaN,heidihall@example.net,70.0,F,Gyeonggi-do,9401 Howard Road Apt. 695,415-850,Gimpo City,South Korea,37.640589,126.566183,Search,2019-01-02 00:19:00 UTC
1,5012,Billy,Guerrero,1.800341e+09,billyguerrero@example.net,33.0,M,Texas,533 Patricia Roads Apt. 472,79928,Horizon City,United States,31.642378,-106.141715,Search,2019-01-02 00:29:00 UTC
2,27817,Antonio,Williams,NaN,antoniowilliams@example.net,20.0,M,Zhejiang,0381 Baker Stream Apt. 075,312599,Wuhan,China,29.504850,120.901029,Search,2019-01-02 00:35:00 UTC
3,14079,Ryan,Brown,NaN,ryanbrown@example.com,68.0,M,Bahia,277 Walker Mountains,45920-000,Nova Viçosa,Brasil,-17.900464,-39.716076,Search,2019-01-02 00:43:00 UTC
4,93946,Sabrina,Rodriguez,1.800594e+09,sabrinarodriguez@example.net,39.0,F,Florida,06720 Smith Summit Suite 860,34711,Clermont,United States,28.525665,-81.756419,Search,2019-01-02 01:14:00 UTC

In [469]:
df_users_clean['full_name'] = df_users_clean['first_name'] + ' ' + df_users_clean['last_name']

In [470]:
df_users_clean.head()

,id,first_name,last_name,phone_number,email,age,gender,state,street_address,postal_code,city,country,latitude,longitude,traffic_source,created_at,full_name
0,21304,Heidi,Hall,NaN,heidihall@example.net,70.0,F,Gyeonggi-do,9401 Howard Road Apt. 695,415-850,Gimpo City,South Korea,37.640589,126.566183,Search,2019-01-02 00:19:00 UTC,Heidi Hall
1,5012,Billy,Guerrero,1.800341e+09,billyguerrero@example.net,33.0,M,Texas,533 Patricia Roads Apt. 472,79928,Horizon City,United States,31.642378,-106.141715,Search,2019-01-02 00:29:00 UTC,Billy Guerrero
2,27817,Antonio,Williams,NaN,antoniowilliams@example.net,20.0,M,Zhejiang,0381 Baker Stream Apt. 075,312599,Wuhan,China,29.504850,120.901029,Search,2019-01-02 00:35:00 UTC,Antonio Williams
3,14079,Ryan,Brown,NaN,ryanbrown@example.com,68.0,M,Bahia,277 Walker Mountains,45920-000,Nova Viçosa,Brasil,-17.900464,-39.716076,Search,2019-01-02 00:43:00 UTC,Ryan Brown
4,93946,Sabrina,Rodriguez,1.800594e+09,sabrinarodriguez@example.net,39.0,F,Florida,06720 Smith Summit Suite 860,34711,Clermont,United States,28.525665,-81.756419,Search,2019-01-02 01:14:00 UTC,Sabrina Rodriguez

3. Remove phone numbers with incorrect length if any
To check the length of every phone number. The function to use is `.str.len()`
First, we want to convert the phone number to a string

In [471]:
df_users_clean['phone_number'] = df_users_clean['phone_number'].astype(str)

In [472]:
df_users_clean.head()

,id,first_name,last_name,phone_number,email,age,gender,state,street_address,postal_code,city,country,latitude,longitude,traffic_source,created_at,full_name
0,21304,Heidi,Hall,nan,heidihall@example.net,70.0,F,Gyeonggi-do,9401 Howard Road Apt. 695,415-850,Gimpo City,South Korea,37.640589,126.566183,Search,2019-01-02 00:19:00 UTC,Heidi Hall
1,5012,Billy,Guerrero,1800341483.0,billyguerrero@example.net,33.0,M,Texas,533 Patricia Roads Apt. 472,79928,Horizon City,United States,31.642378,-106.141715,Search,2019-01-02 00:29:00 UTC,Billy Guerrero
2,27817,Antonio,Williams,nan,antoniowilliams@example.net,20.0,M,Zhejiang,0381 Baker Stream Apt. 075,312599,Wuhan,China,29.504850,120.901029,Search,2019-01-02 00:35:00 UTC,Antonio Williams
3,14079,Ryan,Brown,nan,ryanbrown@example.com,68.0,M,Bahia,277 Walker Mountains,45920-000,Nova Viçosa,Brasil,-17.900464,-39.716076,Search,2019-01-02 00:43:00 UTC,Ryan Brown
4,93946,Sabrina,Rodriguez,1800594461.0,sabrinarodriguez@example.net,39.0,F,Florida,06720 Smith Summit Suite 860,34711,Clermont,United States,28.525665,-81.756419,Search,2019-01-02 01:14:00 UTC,Sabrina Rodriguez

Second, we want to remove the point zero at the back. The function to use is `.str.replace()`. Within the bracket, you will specify three things
1. What you want to replace
2. What you want to replace it with
3. Whether or not you are writing a regex(regular expression): There are two values, true or false

In [473]:
df_users_clean['phone_number'] = df_users_clean['phone_number'].str.replace('.0', '', regex=False)

In [474]:
df_users_clean['phone_number'] = df_users_clean['phone_number'].replace('nan', '', regex=False)

In [475]:
df_users_clean.head()

,id,first_name,last_name,phone_number,email,age,gender,state,street_address,postal_code,city,country,latitude,longitude,traffic_source,created_at,full_name
0,21304,Heidi,Hall,,heidihall@example.net,70.0,F,Gyeonggi-do,9401 Howard Road Apt. 695,415-850,Gimpo City,South Korea,37.640589,126.566183,Search,2019-01-02 00:19:00 UTC,Heidi Hall
1,5012,Billy,Guerrero,1800341483,billyguerrero@example.net,33.0,M,Texas,533 Patricia Roads Apt. 472,79928,Horizon City,United States,31.642378,-106.141715,Search,2019-01-02 00:29:00 UTC,Billy Guerrero
2,27817,Antonio,Williams,,antoniowilliams@example.net,20.0,M,Zhejiang,0381 Baker Stream Apt. 075,312599,Wuhan,China,29.504850,120.901029,Search,2019-01-02 00:35:00 UTC,Antonio Williams
3,14079,Ryan,Brown,,ryanbrown@example.com,68.0,M,Bahia,277 Walker Mountains,45920-000,Nova Viçosa,Brasil,-17.900464,-39.716076,Search,2019-01-02 00:43:00 UTC,Ryan Brown
4,93946,Sabrina,Rodriguez,1800594461,sabrinarodriguez@example.net,39.0,F,Florida,06720 Smith Summit Suite 860,34711,Clermont,United States,28.525665,-81.756419,Search,2019-01-02 01:14:00 UTC,Sabrina Rodriguez

Third, we check the length of every phone number. The function to do that is `.str.len()`

In [476]:
df_users_clean['phone_number_length'] = df_users_clean['phone_number'].str.len()

In [477]:
df_users_clean[['phone_number','phone_number_length']]

      phone_number  phone_number_length
0                                     0
1       1800341483                   10
2                                     0
3                                     0
4       1800594461                   10
...            ...                  ...
99995   1800139067                   10
99996                                 0
99997                                 0
99998   1800953985                   10
99999                                 0

[100000 rows x 2 columns]

In [478]:
df_users_clean.index

RangeIndex(start=0, stop=100000, step=1)

To call specific rows and columns in a dataframe, we use two methods. `.loc` and `iloc`

`.loc` works by calling the row number/row index and **column name**
`.iloc` works by calling the row number/index and **column number/index**

For example, to call the first row:

In [479]:
df_users_clean.loc[[100], ['id', 'city', 'full_name']]

        id     city        full_name
100  45947  Tianjin  Desiree Vincent

In [480]:
df_users_clean.loc[100, ['id', 'city', 'full_name']]

id                     45947
city                 Tianjin
full_name    Desiree Vincent
Name: 100, dtype: object

In [481]:
df_users_clean.iloc[[100], [0, 10, 16]]

        id     city        full_name
100  45947  Tianjin  Desiree Vincent

In [482]:
df_users_clean.iloc[100, [0, 10, 16]]

id                     45947
city                 Tianjin
full_name    Desiree Vincent
Name: 100, dtype: object

Next, we check how many distinct values we have in the length column. The function to use is `.unique()`

In [483]:
df_users_clean['phone_number_length'].unique()

array([ 0, 10,  8,  9], dtype=int64)

for row in df_users_clean.index:
    if df_users_clean.loc[row, 'phone_number_length'] != 10:
        df_users_clean.loc[row, 'phone_number'] = ''

In [484]:
df_users_clean['phone_number_length'] = df_users_clean['phone_number'].str.len()

In [485]:
df_users_clean['phone_number_length'].unique()

array([ 0, 10,  8,  9], dtype=int64)

5. Clean email domain names and write all emails in lower case

In [486]:
df_users_clean.head()

,id,first_name,last_name,phone_number,email,age,gender,state,street_address,postal_code,city,country,latitude,longitude,traffic_source,created_at,full_name,phone_number_length
0,21304,Heidi,Hall,,heidihall@example.net,70.0,F,Gyeonggi-do,9401 Howard Road Apt. 695,415-850,Gimpo City,South Korea,37.640589,126.566183,Search,2019-01-02 00:19:00 UTC,Heidi Hall,0
1,5012,Billy,Guerrero,1800341483,billyguerrero@example.net,33.0,M,Texas,533 Patricia Roads Apt. 472,79928,Horizon City,United States,31.642378,-106.141715,Search,2019-01-02 00:29:00 UTC,Billy Guerrero,10
2,27817,Antonio,Williams,,antoniowilliams@example.net,20.0,M,Zhejiang,0381 Baker Stream Apt. 075,312599,Wuhan,China,29.504850,120.901029,Search,2019-01-02 00:35:00 UTC,Antonio Williams,0
3,14079,Ryan,Brown,,ryanbrown@example.com,68.0,M,Bahia,277 Walker Mountains,45920-000,Nova Viçosa,Brasil,-17.900464,-39.716076,Search,2019-01-02 00:43:00 UTC,Ryan Brown,0
4,93946,Sabrina,Rodriguez,1800594461,sabrinarodriguez@example.net,39.0,F,Florida,06720 Smith Summit Suite 860,34711,Clermont,United States,28.525665,-81.756419,Search,2019-01-02 01:14:00 UTC,Sabrina Rodriguez,10

First, we split the email column using the @ character. The function to do this is `.str.split(expand=True)`. Inside the bracket, you'd say what character you're splitting by. The default is space

In [487]:
df_users_clean['email'].str.split('@', expand=True)[1].unique()

array(['example.net', 'example.com', 'example.org', 'examplec.om', nan],
      dtype=object)

We will replace examplec.om with example.com using the `str.replace()` function

In [488]:
df_users_clean['email'] = df_users_clean['email'].str.replace('examplec.om', 'example.com', regex=False)

In [489]:
df_users_clean['email'].str.split('@', expand=True)[1].unique()

array(['example.net', 'example.com', 'example.org', nan], dtype=object)

In [490]:
df_users_clean.dtypes

id                      object
first_name              object
last_name               object
phone_number            object
email                   object
age                    float64
gender                  object
state                   object
street_address          object
postal_code             object
city                    object
country                 object
latitude               float64
longitude              float64
traffic_source          object
created_at              object
full_name               object
phone_number_length      int64
dtype: object

To convert to lower case, the function to use is `.str.lower()`

In [491]:
df_users_clean['email'] = df_users_clean['email'].str.lower()

6. Fill up blank ages with the mean

For numeric columns, summary statistics such as describe, sum, mean, median, count, quantiles etc.

In [492]:
# summary statistics for all numeric columns
df_users_clean.describe()

                age      latitude     longitude  phone_number_length
count  99998.000000  99998.000000  99998.000000        100000.000000
mean      41.006170     28.305884     24.344178             2.266840
std       17.033479     22.052213     89.964565             4.186826
min       12.000000    -43.160756   -158.164931             0.000000
25%       26.000000     26.110473    -51.049500             0.000000
50%       41.000000     35.247482      4.411841             0.000000
75%       56.000000     40.725404    116.345098             0.000000
max       70.000000     64.865194    153.560238            10.000000

In [493]:
# summary statistics for column specified
df_users_clean['age'].describe()

count    99998.000000
mean        41.006170
std         17.033479
min         12.000000
25%         26.000000
50%         41.000000
75%         56.000000
max         70.000000
Name: age, dtype: float64

# calculate the mean of all numeric columns in the dataframe
df_users_clean.mean()

In [494]:
# calculates the mean of the specified column in the dataframe
df_users_clean['age'].mean()

41.00617012340247

Similar functions like `.median()`, `.sum()`, `.count()` etc

Store the mean age in a variable

In [495]:
mean_age = df_users_clean['age'].mean()

In [496]:
mean_age

41.00617012340247

To fill null values, the function to use is `.fillna()`. In the bracket, you'll specific what you want to fill the blank with. There are two ways you use this function
1.

In [497]:
df_users_clean['age_filled'] = df_users_clean['age'].fillna(mean_age)

If inplace is true, it will perform the action directly on the column, if it's false, it will just give you the result

In [498]:
df_users_clean['age'].fillna(mean_age, inplace=True) # inplace can either be true or false

7. Join latitude and longitude together with a comma separating them

In [499]:
# check data types
df_users_clean.dtypes

id                      object
first_name              object
last_name               object
phone_number            object
email                   object
age                    float64
gender                  object
state                   object
street_address          object
postal_code             object
city                    object
country                 object
latitude               float64
longitude              float64
traffic_source          object
created_at              object
full_name               object
phone_number_length      int64
age_filled             float64
dtype: object

In [500]:
# convert latitude and longitude columns to strings
df_users_clean['latitude'] = df_users_clean['latitude'].astype(str)
df_users_clean['longitude'] = df_users_clean['longitude'].astype(str)

In [501]:
# concat latitude and longitude together
df_users_clean['geo_location'] = df_users_clean['latitude'] + "," + df_users_clean['longitude']

To remove columns from you dataframe, the function to use is `.drop()`. There are three important keywords that you need in the bracket.
1. What you want to drop, either as a string, or a list
2. axis: Drop a row or a column. If it's a column, axis=1, if it's a row, axis=0
3. The inplace keyword

In [502]:
# drop the specified columns
df_users_clean.drop(['first_name', 'last_name', 'latitude', 'longitude', 'phone_number_length', 'age_filled'],
                    axis = 1,
                    inplace = True
                   )

In [503]:
# test that the columns have been dropped
df_users_clean.columns

Index(['id', 'phone_number', 'email', 'age', 'gender', 'state',
       'street_address', 'postal_code', 'city', 'country', 'traffic_source',
       'created_at', 'full_name', 'geo_location'],
      dtype='object')

8. Remove UTC from the `created_at` column

In [504]:
# inspect created_at column
df_users_clean['created_at'].head()

0    2019-01-02 00:19:00 UTC
1    2019-01-02 00:29:00 UTC
2    2019-01-02 00:35:00 UTC
3    2019-01-02 00:43:00 UTC
4    2019-01-02 01:14:00 UTC
Name: created_at, dtype: object

First method: Replace UTC with an empty string

In [505]:
# str.replace function
df_users_clean['created_at_first_method'] = df_users_clean['created_at'].str.replace(' UTC', '', regex=False)

In [506]:
# inspect created_at column
df_users_clean['created_at_first_method'].head()

0    2019-01-02 00:19:00
1    2019-01-02 00:29:00
2    2019-01-02 00:35:00
3    2019-01-02 00:43:00
4    2019-01-02 01:14:00
Name: created_at_first_method, dtype: object

Confirm the new data type

In [507]:
# data type
df_users_clean['created_at_first_method'].dtypes

dtype('O')

Convert to datetime. To do this, the function to use is `pandas.to_datetime()`. Inside the bracket:
1. What you want to convert

In [508]:
# convert to datetime
df_users_clean['created_at_first_method'] = pd.to_datetime(df_users_clean['created_at_first_method'])

In [509]:
# data type
df_users_clean['created_at_first_method'].dtypes

dtype('<M8[ns]')

In [510]:
df_users_clean.dtypes

id                                 object
phone_number                       object
email                              object
age                               float64
gender                             object
state                              object
street_address                     object
postal_code                        object
city                               object
country                            object
traffic_source                     object
created_at                         object
full_name                          object
geo_location                       object
created_at_first_method    datetime64[ns]
dtype: object

Second method: Spliting the created_at column

In [511]:
split_time_columns = df_users_clean['created_at'].str.split(' ',expand=True)

In [512]:
df_users_clean['created_at_second_method'] = split_time_columns[0] + " " + split_time_columns[1]

In [513]:
df_users_clean['created_at_second_method'].dtypes

dtype('O')

In [514]:
# convert to datetime
df_users_clean['created_at_second_method'] = pd.to_datetime(df_users_clean['created_at_second_method'])

In [515]:
df_users_clean['created_at_second_method'].dtypes

dtype('<M8[ns]')

9. In the country column, we want to change:
* Brazil to Brasil
* Deutschland to Germany
* Espana to Spain

In [516]:
# list out the unique countries
df_users_clean['country'].unique()

array(['South Korea', 'United States', 'China', 'Brasil', 'Australia',
       'Spain', 'France', 'United Kingdom', 'Germany', 'Belgium', 'Japan',
       'Poland', 'Colombia', 'España', 'Austria', 'Deutschland', 'Brazil'],
      dtype=object)

In [517]:
# replace all these country names
# first method
df_users_clean['country_first_method'] = df_users_clean['country'].replace('Brazil','Brasil').replace('Deutschland','Germany').replace('España','Spain')

In [518]:
# create a dictionary of columns to change
columns_to_change = {'Brazil':'Brasil', 'Deutschland':'Germany', 'España':'Spain'}

In [519]:
# second method
df_users_clean['country_second_method'] = df_users_clean['country'].replace(columns_to_change)

# Dealing with duplicates

1. Are there duplicates? `.duplicated()`
2. How many duplicates are there? `.duplicated().sum()`
3. How to remove these duplicates? `.drop_duplicates(inplace=True/False)`
* If you don't specific a column, or list of columns, it will automatically check for duplictes in the entrie record and drop them
* To drop duplicates in a specific column, specify that column/list of columns in a square bracket within the round bracket
* The keep keyword is important. It can either be 'first'(keeps the first occurence), 'last'(keeps the last occurence), False (removes all records that were duplicated)
4. What are these duplicates? This involves querying or filtering the data to see the duplicates

**For illustration purposes**, we will remove duplicates in the email column. However, before removing duplicates, always double check to ensure that these are indeed duplicated records.

In [528]:
# masking
duplicated = df_users_clean[df_users_clean.duplicated(['email'])]

In [520]:
df_users_clean.duplicated(['email']).sum()

16171

In [521]:
df_users.duplicated(['email']).sum()

16170

In [522]:
# drop duplicate records in the dataframe
first_email_occurence = df_users_clean.drop_duplicates(['email'], keep='first')
last_email_occurence = df_users_clean.drop_duplicates(['email'], keep='last')
discard_all_duplicated_records = df_users_clean.drop_duplicates(['email'], keep=False)

In [523]:
first_email_occurence.duplicated(['email']).sum()

0

In [524]:
last_email_occurence.duplicated(['email']).sum()

0

In [525]:
discard_all_duplicated_records.duplicated(['email']).sum()

0

To sort a dataframe, the function to use is `.sort_values()`. In the bracket, you tell it two things
1. What you want to sort by
2. How. Ascending(default) or Descending

In [533]:
duplicated.sort_values(['email'], ascending=False)

,id,phone_number,email,age,gender,state,street_address,postal_code,city,country,traffic_source,created_at,full_name,geo_location,created_at_first_method,created_at_second_method,country_first_method,country_second_method
17910,6355,,zacharywilson@example.net,63.0,M,Mato Grosso do Sul,2647 Pacheco Road,79200-000,Aquidauana,Brasil,Search,2019-10-17 16:59:00 UTC,Zachary Wilson,"-19.75549055,-55.86324783",2019-10-17 16:59:00.000000,2019-10-17 16:59:00.000000,Brasil,Brasil
40255,89452,,zacharywilson@example.net,36.0,M,England,758 Danielle Forge Suite 807,LA14,Barrow-in-Furness,United Kingdom,Search,2020-10-13 17:01:00 UTC,Zachary Wilson,"54.12374037,-3.230345256",2020-10-13 17:01:00.000000,2020-10-13 17:01:00.000000,United Kingdom,United Kingdom
48533,21973,,zacharywilson@example.net,69.0,M,England,852 Scott Square Apt. 795,BH12,Poole,United Kingdom,Search,2021-02-25 01:41:00 UTC,Zachary Wilson,"50.7398895,-1.926010443",2021-02-25 01:41:00.000000,2021-02-25 01:41:00.000000,United Kingdom,United Kingdom
65342,51256,,zacharywhite@example.com,57.0,M,Nagano,49654 Green Port Suite 860,393-0000,Shimosuwa town,Japan,Search,2021-11-23 10:29:00 UTC,Zachary White,"36.11057289,138.1125061",2021-11-23 10:29:00.000000,2021-11-23 10:29:00.000000,Japan,Japan
81908,3694,,zacharywhite@example.com,46.0,M,Wales,722 Rebecca Trace,LL18,Rhyl,United Kingdom,Email,2022-08-19 17:11:00 UTC,Zachary White,"53.2964742,-3.43619343",2022-08-19 17:11:00.000000,2022-08-19 17:11:00.000000,United Kingdom,United Kingdom
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
46502,30827,1800794763,aaronbrown@example.net,37.0,M,California,839 Jacqueline Motorway,94565,Pittsburg,United States,Search,2021-01-23 04:14:00 UTC,Aaron Brown,"38.01139832,-121.9111236",2021-01-23 04:14:00.000000,2021-01-23 04:14:00.000000,United States,United States
16913,43837,,aaronbrown@example.net,57.0,M,Chongqing,302 Bentley Skyway Apt. 818,401320,Huainan,China,Email,2019-10-02 09:10:00 UTC,Aaron Brown,"29.39418141,106.5309096",2019-10-02 09:10:00.000000,2019-10-02 09:10:00.000000,China,China
82877,38846,,aaronbishop@example.net,63.0,M,Gyeonggi-do,603 Holmes Rest Suite 538,427-060,Gwacheon City,South Korea,Search,2022-09-04 12:01:00 UTC,Aaron Bishop,"37.45178501,126.9979733",2022-09-04 12:01:00.000000,2022-09-04 12:01:00.000000,South Korea,South Korea
99332,34467,,aaronbarnett@example.net,32.0,M,Santa Catarina,12160 Ryan Cape Apt. 002,88240-000,São João Batista,Brasil,Search,2023-04-25 12:29:58.259158 UTC,Aaron Barnett,"-27.33387535,-48.8658571",2023-04-25 12:29:58.259158,2023-04-25 12:29:58.259158,Brasil,Brasil
83704,98330,,aaronbailey@example.com,28.0,M,Zhejiang,535 Timothy Trail,325299,Shenzhen,China,Organic,2022-09-17 15:18:00 UTC,Aaron Bailey,"27.77292648,120.6446411",2022-09-17 15:18:00.000000,2022-09-17 15:18:00.000000,China,China